Конфигурация/InformationRegisters/НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиРасчетаРыночнойСтавкиПоВидамАктивов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаПроверкиСущественностиОтклонений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОпределенияРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодичностиОпределенияРыночнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаНаРыночностьТолькоПриПервоначальномПризнании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаБанков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаСрокаДляОтбораРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаСрокаДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаСрокаДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаСрокаДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПолученияКлючевойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПолученияДатыКлючевойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДатыСобытийПриПримененииРыночнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантыРасчетаРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаРыночнойСтавкиПоДепозитамНФО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиОтклоненияОтРыночнойСтавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтавкиДляПроверкиНаРыночность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиВПроцентныхПунктах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникТаблицыСоответствияРейтингов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонениеКредитногоСпреда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОтклоненияОтРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПоказыватьОтрицательныеПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтавкиДляРасчетаДисконтированногоПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьЭСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаНаРыночностьПоПеречнюЦБ580П</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНаблюдаемыхПроцентныхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеСтандартногоОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаКорректировкиЭСП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьЛинейноНерыночныеАктивы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиНаДатуРазмещенияАктива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИгнорироватьИзменениеКлючевойСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаКоэффициентаВолатильности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаКоэффициентаВолатильности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСредневзвешеннойРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСредневзвешенныхСтавок</v8:Type>
						<v8:Type>cfg:CatalogRef.БиржевыеИндексы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьГраницДиапазонаРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокАктиваДляИспользованияСхемы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыРасчетаОценочнойСтоимости</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивовДляПроверкиНаРыночность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночнаяИОтклонениеСтоимостиПоЭСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночнаяИлиОтклонениеСтоимостиПоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеСтоимостиПоЭСППоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКлючевойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроверять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересчитатьПоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагентИлиСтавкаРыночная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛинейноИПоФактическойЭСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоМетодикеКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КБДИMosPrime1День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНеРеализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаПрекратилаДействие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КриваяБезрисковойДоходности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоэффициентВолатильностиРычнонойСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартноеОтклонениеПоГенеральнойСовокупности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыАктивовДляПроверкиНаРыночность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыАктивовДляПроверкиНаРыночность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Депозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямоеРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбратноеРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебиторскаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаймыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаймыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредиторскаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредиторскаяЗадолженностьПоДолгосрочнойАренде</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиРасчетаРыночнойСтавкиПоВидамАктивов/Ext/RecordSetModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		МассивДоступныхСхем = РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ПолучитьМассивДоступныхСхем(Запись.ВидАктива);
		
		Если МассивДоступныхСхем.Найти(Запись.СхемаПроверкиСущественностиОтклонений) = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Схема: '" + Запись.СхемаПроверкиСущественностиОтклонений + "' не может быть использована для вида актива '" + Запись.ВидАктива + "'",,,, Отказ);
		КонецЕсли;
		
		ПроверкаЗаполненияЗаписи(Запись, Отказ);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПроверкаЗаполненияЗаписи(Запись, Отказ)
	
	СписокИспользуемыхИзмеренийИРесурсов = РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.ИспользуемыеИзмеренияИРесурсы(Запись);
	
	//Ресурсы могут быть пустыми, исключаем из проверки	
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиОтклоненияОтРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьГраницДиапазонаРыночнойСтавки"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ОтклонениеКредитногоСпреда"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьЭСП"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("СмещениеСтандартногоОтклонения"));
	СписокИспользуемыхИзмеренийИРесурсов.Удалить(СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокАктиваДляИспользованияСхемы"));
	
	//Если ресурс используется, он должен быть заполнен. Если нет, должен быть пустым
	Для Каждого Ресурс Из СписокИспользуемыхИзмеренийИРесурсов Цикл
		УниверсальныеМеханизмы.ПроверкаЗаполненияИзмеренияИлиРесурса(ЭтотОбъект, Запись, Ресурс.Значение, Отказ, Ресурс.Пометка);
	КонецЦикла;
	
	Если Запись.СхемаПроверкиСущественностиОтклонений = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке
	   И Запись.ВариантОтклоненияОтРыночнойСтавки <> Перечисления.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.Фиксированный Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для схемы '" + Запись.СхемаПроверкиСущественностиОтклонений + "' доступен только фиксированный вариант отклонения по рыночной ставке",,,, Отказ);
	КонецЕсли;
	
#Область РассчитыватьЛинейноНерыночныеАктивы

	Если Запись.РассчитыватьЛинейноНерыночныеАктивы И Запись.ВидАктива <> Перечисления.ВидыАктивовДляПроверкиНаРыночность.Депозиты Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Линейный расчёт нерыночных активов доступ только для депозитов",,,, Отказ);
	КонецЕсли;	
	
#КонецОбласти

КонецПроцедуры
